In [2]:
import pandas as pd

df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4    Harry      Ranchi   93.0
5     Amit     Kolkata   15.0
6    Ahmed       Delhi   14.0
7  Raheman      Mumbai   34.0
8    Hafiz       Delhi    NaN

In [3]:
df.marks.describe() #to check description of marks

count     8.000000
mean     40.375000
std      33.101306
min      14.000000
25%      16.500000
50%      29.000000
75%      48.500000
max      93.000000
Name: marks, dtype: float64

In [4]:
df.name.describe() #freq means count

count         9
unique        8
top       Harry
freq          2
Name: name, dtype: object

In [5]:
df.marks.mean() #to check mean value

40.375

In [6]:
df.name.unique()

array(['Harry', 'Rohan', 'Skillf', 'Shubh', 'Amit', 'Ahmed', 'Raheman',
       'Hafiz'], dtype=object)

In [8]:
df.name.value_counts() #to check counts of any name

name
Harry      2
Rohan      1
Skillf     1
Shubh      1
Amit       1
Ahmed      1
Raheman    1
Hafiz      1
Name: count, dtype: int64